# Pandas

- Analyse 2D or multi dimensional data
- Table like data
- Internally they use numpy
-

In [4]:
import pandas as pd

In [5]:

data = {
    "Name": ["John", "Anna", "Peter", "Linda"],
    "Age": [28, 34, 29, 32],
    "City": ["New York", "Paris", "Berlin", "London"],
}

data

{'Name': ['John', 'Anna', 'Peter', 'Linda'],
 'Age': [28, 34, 29, 32],
 'City': ['New York', 'Paris', 'Berlin', 'London']}

## Creating DataFrame

In [6]:
df = pd.DataFrame(data)

df

    Name  Age      City
0   John   28  New York
1   Anna   34     Paris
2  Peter   29    Berlin
3  Linda   32    London

## Filtering columns

- Select Name from df

In [7]:
df["Name"]

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

## First two rows
Select * 
From df 
Limit 2

In [8]:
df.head(2)

   Name  Age      City
0  John   28  New York
1  Anna   34     Paris

In [9]:
df.head()

    Name  Age      City
0   John   28  New York
1   Anna   34     Paris
2  Peter   29    Berlin
3  Linda   32    London

In [10]:
import numpy as np

In [11]:
items = np.array(
    [
        " Apple",
        "banana ",
        "GRAPE",
        "cucumber",
        "Pineapple",
        " tomato ",
        "Orange",
        "Orange",
        " lemon",
        "Kiwi ",
        "mango",
        "blueberry ",
        " raspberry",
    ]
)

print(type(items))
print(type(items[0]))

<class 'numpy.ndarray'>
<class 'numpy.str_'>

In [12]:
hourly_visitors = np.array([468, 279, 73, 272, 406, 128, 302, 216, 140, 82])

print(type(hourly_visitors))
print(type(hourly_visitors[0]))

<class 'numpy.ndarray'>
<class 'numpy.int64'>

## Info about data
- Columns
- Datatype
- Space occupied
- Null
- Fell for the data

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [14]:
df

    Name  Age      City
0   John   28  New York
1   Anna   34     Paris
2  Peter   29    Berlin
3  Linda   32    London

In [15]:
df.shape  # (rows, columns)

(4, 3)

In [16]:
df.dtypes  # DataType

Name    object
Age      int64
City    object
dtype: object

In [17]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [18]:
df.describe()

             Age
count   4.000000
mean   30.750000
std     2.753785
min    28.000000
25%    28.750000
50%    30.500000
75%    32.500000
max    34.000000

In [19]:
df.describe(include="all") # Force all the columns

        Name        Age      City
count      4   4.000000         4
unique     4        NaN         4
top     John        NaN  New York
freq       1        NaN         1
mean     NaN  30.750000       NaN
std      NaN   2.753785       NaN
min      NaN  28.000000       NaN
25%      NaN  28.750000       NaN
50%      NaN  30.500000       NaN
75%      NaN  32.500000       NaN
max      NaN  34.000000       NaN

In [20]:
people_df = df.describe(include="all")

people_df["City"]

count            4
unique           4
top       New York
freq             1
mean           NaN
std            NaN
min            NaN
25%            NaN
50%            NaN
75%            NaN
max            NaN
Name: City, dtype: object

In [21]:
tips_df = pd.read_csv("./tips.csv")

In [33]:
tips_df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [ ]:
tips_df[0:5]
tips_df.head(5) # Preferred way

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [25]:
tips_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [26]:
tips_df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

## SELECT day, time, tip FROM tips_df

In [32]:
tips_df[['day', 'time', 'tip']]

      day    time   tip
0     Sun  Dinner  1.01
1     Sun  Dinner  1.66
2     Sun  Dinner  3.50
3     Sun  Dinner  3.31
4     Sun  Dinner  3.61
..    ...     ...   ...
239   Sat  Dinner  5.92
240   Sat  Dinner  2.00
241   Sat  Dinner  2.00
242   Sat  Dinner  1.75
243  Thur  Dinner  3.00

[244 rows x 3 columns]

In [31]:
tips_df[["day", "time", "tip"]].head(10)

   day    time   tip
0  Sun  Dinner  1.01
1  Sun  Dinner  1.66
2  Sun  Dinner  3.50
3  Sun  Dinner  3.31
4  Sun  Dinner  3.61
5  Sun  Dinner  4.71
6  Sun  Dinner  2.00
7  Sun  Dinner  3.12
8  Sun  Dinner  1.96
9  Sun  Dinner  3.23

# Find the how much percentage people are tiping
 
- Find tip percentage
- Add it as another column - tip_percent
- Round off to 2 decimal
- `20.34` not be `0.243`

In [34]:


# Assuming tips_df is already loaded
tips_df["tip_percent"] = (tips_df["tip"] / tips_df["total_bill"]) * 100

# Round off to 2 decimal places
tips_df["tip_percent"] = tips_df["tip_percent"].round(2)

# Display the updated DataFrame
tips_df.head()

   total_bill   tip     sex smoker  day    time  size  tip_percent
0       16.99  1.01  Female     No  Sun  Dinner     2         5.94
1       10.34  1.66    Male     No  Sun  Dinner     3        16.05
2       21.01  3.50    Male     No  Sun  Dinner     3        16.66
3       23.68  3.31    Male     No  Sun  Dinner     2        13.98
4       24.59  3.61  Female     No  Sun  Dinner     4        14.68

## Task 1
- Filter the rows where people dined on a Sunday
- Clue: Boolean matrix

In [38]:
tips_df.sort_values(by="tip_percent", ascending=False).head(5)
tips_df.sort_values(by="total_bill", ascending=False).head(5)

     total_bill    tip   sex smoker  day    time  size  tip_percent
170       50.81  10.00  Male    Yes  Sat  Dinner     3        19.68
212       48.33   9.00  Male     No  Sat  Dinner     4        18.62
59        48.27   6.73  Male     No  Sat  Dinner     4        13.94
156       48.17   5.00  Male     No  Sun  Dinner     6        10.38
182       45.35   3.50  Male    Yes  Sun  Dinner     3         7.72

In [41]:
tips_df[tips_df["day"] == "Sun"]

     total_bill   tip     sex smoker  day    time  size  tip_percent
0         16.99  1.01  Female     No  Sun  Dinner     2         5.94
1         10.34  1.66    Male     No  Sun  Dinner     3        16.05
2         21.01  3.50    Male     No  Sun  Dinner     3        16.66
3         23.68  3.31    Male     No  Sun  Dinner     2        13.98
4         24.59  3.61  Female     No  Sun  Dinner     4        14.68
..          ...   ...     ...    ...  ...     ...   ...          ...
186       20.90  3.50  Female    Yes  Sun  Dinner     3        16.75
187       30.46  2.00    Male    Yes  Sun  Dinner     5         6.57
188       18.15  3.50  Female    Yes  Sun  Dinner     3        19.28
189       23.10  4.00    Male    Yes  Sun  Dinner     3        17.32
190       15.69  1.50    Male    Yes  Sun  Dinner     2         9.56

[76 rows x 8 columns]

## Task 2
Get the rows where person have tipped more than R3 on a Friday

In [ ]:
tips_df[tips_df["tip"] > "3" ["day"] =="Fri"].head(5)

<>:1: SyntaxWarning: 'int' object is not subscriptable; perhaps you missed a comma?
<>:1: SyntaxWarning: 'int' object is not subscriptable; perhaps you missed a comma?
C:\Users\E1009817\AppData\Local\Temp\ipykernel_5436\62860097.py:1: SyntaxWarning: 'int' object is not subscriptable; perhaps you missed a comma?
  tips_df[tips_df["tip"] > 3["day"] =="Fri"].head(5)

TypeError: 'int' object is not subscriptable